<a href="https://colab.research.google.com/github/ShaikMohammadUsman/Machine-Learning/blob/master/Pandas(DataAnalysis_3).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
drinks=pd.read_csv('http://bit.ly/drinksbycountry')

In [2]:
drinks.head(2)

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe

[2 rows x 6 columns]

In [4]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [5]:
##  Memory each oject is taking  ###

drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [6]:
drinks.memory_usage()  ### columns memory size

Index                            128
country                         1544
beer_servings                   1544
spirit_servings                 1544
wine_servings                   1544
total_litres_of_pure_alcohol    1544
continent                       1544
dtype: int64

In [8]:
drinks.memory_usage(deep=True)  ### columns memory size in deep

Index                             128
country                         12588
beer_servings                    1544
spirit_servings                  1544
wine_servings                    1544
total_litres_of_pure_alcohol     1544
continent                       12332
dtype: int64

In [9]:
drinks.continent.unique()  ###Unique features in columns

array(['Asia', 'Europe', 'Africa', 'North America', 'South America',
       'Oceania'], dtype=object)

In [10]:
drinks.continent.value_counts()  ##  Unique features wth the no of values

Africa           53
Europe           45
Asia             44
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [16]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [19]:
### converting object datatype into category datatype actually saves upa lot of size and also changes the representation f all the different categories into 0,1,2,3(Numeric representation in the backend)

drinks['continent']=drinks['continent'].astype('category')  ## converting continent column which is an object datatype to category,,,

In [20]:
drinks.dtypes

country                           object
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [21]:
drinks.memory_usage(deep=True)  ## Now after converting into the categorical datatype we can see that the memory usage has been reduced drastically ###  reduced to 744 bytes ###

Index                             128
country                         12588
beer_servings                    1544
spirit_servings                  1544
wine_servings                    1544
total_litres_of_pure_alcohol     1544
continent                         744
dtype: int64

In [24]:
drinks.continent.cat.codes.head

<bound method NDFrame.head of 0      1
1      2
2      0
3      2
4      0
      ..
188    5
189    1
190    1
191    0
192    0
Length: 193, dtype: int8>

In [26]:
drinks.info(memory_usage=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    category
dtypes: category(1), float64(1), int64(3), object(1)
memory usage: 8.1+ KB

In [29]:
drinks['country']=drinks['country'].astype('category')

In [31]:
drinks.info(memory_usage=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    category
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    category
dtypes: category(2), float64(1), int64(3)
memory usage: 13.4 KB

In [35]:
df=pd.DataFrame({'ID':[100,101,102,103],'quality':['good','verygood','verygood','excellent']})

In [36]:
df

    ID    quality
0  100       good
1  101   verygood
2  102   verygood
3  103  excellent

In [39]:
 df.sort_values('quality')

    ID    quality
3  103  excellent
0  100       good
1  101   verygood
2  102   verygood

In [42]:
#df['quality']=df.quality.astype('category',categories'=['good','verygood','verygood','excellent'],ordered=True)

In [ ]:
###    How to read pandas documentation  ###



##   It is common in pandas to be able to access the 'method' as dataframe or series or as a toplevel function

In [43]:
ufo=pd.read_csv('http://bit.ly/uforeports')

In [44]:
ufo.head(4)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [45]:
pd.isnull(ufo).head() ###  dataframe is used inside a  method

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [46]:
ufo.isnull().head()  ## method is used on dataframe

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [50]:
ufo.sample(n=8,random_state=10)  ### to get the random no of rows

                  City Colors Reported Shape Reported State              Time
15874          Alturas          ORANGE       FIREBALL    FL   2/10/2000 19:30
7523     San Francisco             NaN         SPHERE    CA    9/1/1994 18:00
4478      Newport News             NaN          OTHER    VA   12/10/1980 0:00
13457  Howell Township             NaN       TRIANGLE    NJ    5/10/1999 7:30
8993    Christiansburg             NaN       TRIANGLE    VA  12/24/1995 23:30
11538          Norfolk             NaN          OTHER    MA    5/20/1998 3:15
7581          Marshall             NaN           DISK    TX  10/15/1994 23:15
5314         Arlington             NaN       TRIANGLE    WA    8/15/1985 3:00

In [51]:
ufo.sample(frac=0.25,random_state=4)

                 City Colors Reported Shape Reported State              Time
10201       Oceanside          ORANGE          OTHER    CA    5/2/1997 22:00
11407       Whitefish             NaN            NaN    MT   4/12/1998 23:00
10342          Renton             NaN           DISK    WA    6/8/1997 19:16
8985       Scottsdale             NaN            NaN    AZ  12/18/1995 21:45
2154      San Antonio             RED           OVAL    TX   9/15/1971 10:30
...               ...             ...            ...   ...               ...
2834         Uxbridge             NaN          LIGHT    MA    1/13/1975 1:30
18121  Redwood Valley            BLUE          LIGHT    CA   12/15/2000 1:09
14560      Darlington             NaN           DISK    SC   9/12/1999 10:00
4142           Yakima             NaN          OTHER    WA   7/15/1979 22:30
5036       Sweetwater             NaN            NaN    TN     6/1/1984 0:00

[4560 rows x 5 columns]

In [52]:
##   while training and testing we need to split the 75 percent and we can do it with the help of the pandas ##

train=ufo.sample(frac=0.75,random_state=99)

In [ ]:
test=ufo.loc[~ufo.index.isin(train.index),:]  ###select only those rows which are not included in the training data(train)

In [54]:
###     Dummy variables in pandas  $$

ship=pd.read_csv('http://bit.ly/kaggletrain')

In [55]:
ship.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [59]:
ship['Sex'].head(3)

0      male
1    female
2    female
Name: Sex, dtype: object

In [60]:
ship['Sex']=ship['Sex'].map({'male':1,'female':0})  ## Convertinmg the categorical value into 0's and 1's

In [61]:
ship.head(2)

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C

[2 rows x 12 columns]

In [71]:
sex=pd.get_dummies(ship.Sex,prefix=['female']) ##Here we are creating no of columns which are equal to the no of categories in a column..basically we have 2 categories so we create 2 numbers representation

In [73]:
pd.concat([ship,sex],axis=1)

     PassengerId  Survived  Pclass  ... Embarked  ['female']_0  ['female']_1
0              1         0       3  ...        S             0             1
1              2         1       1  ...        C             1             0
2              3         1       3  ...        S             1             0
3              4         1       1  ...        S             1             0
4              5         0       3  ...        S             0             1
..           ...       ...     ...  ...      ...           ...           ...
886          887         0       2  ...        S             0             1
887          888         1       1  ...        S             1             0
888          889         0       3  ...        S             1             0
889          890         1       1  ...        C             0             1
890          891         0       3  ...        Q             0             1

[891 rows x 14 columns]

In [ ]:

##    24 videos till now

In [75]:
##  to pass a dataframe to pd.dummies  and  specify those columns where i hasd to perform dummies###

pd.get_dummies(ship,columns=['Sex',"Embarked"],drop_first=True)  ###  we passed complete dataframe and we mentioned the columns on ehcih dummies are performed

     PassengerId  Survived  Pclass  ... Sex_1  Embarked_Q  Embarked_S
0              1         0       3  ...     1           0           1
1              2         1       1  ...     0           0           0
2              3         1       3  ...     0           0           1
3              4         1       1  ...     0           0           1
4              5         0       3  ...     1           0           1
..           ...       ...     ...  ...   ...         ...         ...
886          887         0       2  ...     1           0           1
887          888         1       1  ...     0           0           1
888          889         0       3  ...     0           0           1
889          890         1       1  ...     1           0           0
890          891         0       3  ...     1           1           0

[891 rows x 13 columns]

In [ ]:
 ##   Working with dates and time in pandas

In [76]:
 ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [77]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [78]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [80]:
ufo.Time.str.slice(-5,-3).astype('int').head()  # we are converting series values to the integers

0    22
1    20
2    14
3    13
4    19
Name: Time, dtype: int64

In [82]:
ufo['Time']=pd.to_datetime(ufo['Time']) # converting time to datetimeforamt

In [83]:
ufo.dtypes # now you can se it got converted to date time foramt

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

In [85]:
ufo.Time.dt.hour  # gives us hours

0        22
1        20
2        14
3        13
4        19
         ..
18236    23
18237    23
18238    23
18239    23
18240    23
Name: Time, Length: 18241, dtype: int64

In [89]:
ufo.Time.dt.weekday # gives us the weekday

0        6
1        0
2        6
3        0
4        1
        ..
18236    6
18237    6
18238    6
18239    6
18240    6
Name: Time, Length: 18241, dtype: int64

In [91]:
ts=pd.to_datetime('1/1/1999') ## When you pass somethng to datetime it automaticlly converts to its dat time

In [93]:
ufo.loc[ufo['Time'] > ts]  # gives timestamo which are ghreater than the ''ts'' time stamop

                    City Colors Reported  ... State                Time
12832          Loma Rica             NaN  ...    CA 1999-01-01 02:30:00
12833            Bauxite             NaN  ...    AR 1999-01-01 03:00:00
12834           Florence             NaN  ...    SC 1999-01-01 14:00:00
12835       Lake Henshaw             NaN  ...    CA 1999-01-01 15:00:00
12836  Wilmington Island             NaN  ...    GA 1999-01-01 17:15:00
...                  ...             ...  ...   ...                 ...
18236         Grant Park             NaN  ...    IL 2000-12-31 23:00:00
18237        Spirit Lake             NaN  ...    IA 2000-12-31 23:00:00
18238        Eagle River             NaN  ...    WI 2000-12-31 23:45:00
18239        Eagle River             RED  ...    WI 2000-12-31 23:45:00
18240               Ybor             NaN  ...    FL 2000-12-31 23:59:00

[5409 rows x 5 columns]

In [96]:

ufo.isna().sum() ##gives us total null values in all columns

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [99]:
## How do i find and remove duplicate rows in pandas 

ufo.City.duplicated().sum()

11764

In [100]:
ufo.loc[ufo.City.duplicated(),['City']]

                 City
22                NaN
26         Wilderness
71            Roswell
73            Roswell
74           Syracuse
...               ...
18233       Anchorage
18235  Fountain Hills
18237     Spirit Lake
18238     Eagle River
18239     Eagle River

[11764 rows x 1 columns]

In [108]:
ufo[ufo.duplicated()]

                City Colors Reported Shape Reported State                Time
195            Miami             NaN           DISK    FL 1952-06-30 21:00:00
469          Madison             NaN          CIGAR    WI 1957-12-28 00:00:00
473         Winooski             NaN           OVAL    VT 1958-04-17 21:30:00
869           Covina             NaN          CIGAR    CA 1964-05-15 15:00:00
943     Mt. Prospect             NaN           DISK    IL 1964-09-25 19:00:00
...              ...             ...            ...   ...                 ...
17665  Mohawk Valley             NaN          OTHER    AZ 2000-10-13 01:00:00
17843         Cygnet             NaN            EGG    OH 2000-10-31 19:15:00
17871          Dover             NaN       TRIANGLE    DE 2000-11-03 19:40:00
18195        Walpole           GREEN       FIREBALL    NH 2000-12-26 18:20:00
18231    Pismo Beach             NaN           OVAL    CA 2000-12-31 20:00:00

[109 rows x 5 columns]

In [104]:
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object

In [105]:
type(ufo)

pandas.core.frame.DataFrame

In [109]:
ufo[ufo.duplicated(keep='first')] # keeps the 1st occurance and then marks other occurances as duplicates

                City Colors Reported Shape Reported State                Time
195            Miami             NaN           DISK    FL 1952-06-30 21:00:00
469          Madison             NaN          CIGAR    WI 1957-12-28 00:00:00
473         Winooski             NaN           OVAL    VT 1958-04-17 21:30:00
869           Covina             NaN          CIGAR    CA 1964-05-15 15:00:00
943     Mt. Prospect             NaN           DISK    IL 1964-09-25 19:00:00
...              ...             ...            ...   ...                 ...
17665  Mohawk Valley             NaN          OTHER    AZ 2000-10-13 01:00:00
17843         Cygnet             NaN            EGG    OH 2000-10-31 19:15:00
17871          Dover             NaN       TRIANGLE    DE 2000-11-03 19:40:00
18195        Walpole           GREEN       FIREBALL    NH 2000-12-26 18:20:00
18231    Pismo Beach             NaN           OVAL    CA 2000-12-31 20:00:00

[109 rows x 5 columns]

In [112]:
ufo.drop_duplicates(keep='first').shape   ## keeps the 1st version of duplicates

(18132, 5)

In [115]:
ufo.drop_duplicates(keep='last').shape   # keeeps the last version of duplicates

(18132, 5)

In [116]:
ufo.drop_duplicates(keep=False).shape   # drops the both the versions of duplicates

(18029, 5)

In [117]:
ufo.drop_duplicates(subset=['City','State']).shape

(8043, 5)